#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ultrasound-probes/terraform-github/runs/run-etXijgfwAgzhqux6

Waiting for the plan to start...

Terraform v0.15.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.this["terraform-github"]: Refreshing state... [id=terraform-github]
github_repository.this["WIDH-UP"]: Refreshing state... [id=WIDH-UP]
github_repository.this["airflow-dags"]: Refreshing state... [id=airflow-dags]
github_repository.this["terraform-cloud"]: Refreshing state... [id=terraform-cloud]
github_branch_protection.this["terraform-github"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjAzMjc5OTk=]
github_branch_protection.this["terraform-cloud"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjAzMjgwMDA=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.this["airflow-dags"] will be updated in-place
  ~ resource "github_repository" "this" {
        id                     = "airflow-dags"
        name                   = "airflow-dags"
      ~ topics                 = [
          - "airflow",
          - "dags",
        ]
        # (25 unchanged attributes hidden)
    }

  # github_repository.this["terraform-cloud"] will be updated in-place
  ~ resource "github_repository" "this" {
        id                     = "terraform-cloud"
        name                   = "terraform-cloud"
      ~ topics                 = [
          - "iac",
          - "terraform",
        ]
        # (25 unchanged attributes hidden)
    }

  # github_repository.this["terraform-github"] will be updated in-place
  ~ resource "github_repository" "this" {
        id                     = "terraform-github"
        name                   = "terraform-github"
      ~ topics                 = [
          - "github",
          - "gitops",
          - "iac",
          - "terraform",
        ]
        # (25 unchanged attributes hidden)
    }

  # github_repository.this["terraform-oci-vcn"] will be created
  + resource "github_repository" "this" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Terraform module to provision networking on Oracle Cloud Infrastructure"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Terraform"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform-oci-vcn"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

Plan: 1 to add, 3 to change, 0 to destroy.

```

</details>
*Pusher: @Blizter, Action: `pull_request`*